# BeamSystemType Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BeamSystemType Class
Members See Also
---
An object that specifies the type of a beam system in Autodesk Revit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class BeamSystemType : ElementType
```

Visual Basic
---
```text
Public Class BeamSystemType _
	Inherits ElementType
```

Visual C++
---
```text
public ref class BeamSystemType : public ElementType
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB..::..BeamSystemType
# See Also
BeamSystemType Members
Autodesk.Revit.DB Namespace